#include <iostream>

// Лабораторная работа 9. Интерпретация целых чисел.

// Дано целое число типа unsigned short.
// Вывести на экран содержимое каждого из его байтов,
// используя знания по указателям.
// Дать обоснование полученному результату.

int main()
{
    std::cout << "[i] Starting Laboratory9..." << std::endl;

    

    std::cout << "[i] Laboratory9 ended succesfully!" << std::endl;
    return 0;
}